NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/bootloader_info.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/
#include <stdio.h>
#include <string.h>
#include "bootloader_info.h"
#include "dfu_types_mesh.h"
#include "bootloader_app_bridge.h"
#include "nrf51.h"
#include "nrf_error.h"
#include "toolchain.h"
#include "bl_log.h"

#define WORD_ALIGN(data) data = (((uint32_t) data + 4) & 0xFFFFFFFC)

#define HEADER_LEN       (sizeof(bootloader_info_header_t))

#ifdef DEBUG
#undef DEBUG
#define DEBUG 0
#endif

#define PIN_INVALIDATE      (0)
#define PIN_RESET           (1)
#define PIN_ENTRY_GET       (2)
#define PIN_SET_LEN         (3)
#define PIN_ENTRY_PUT       (4)
#define PIN_INIT            (5)

#define INFO_WRITE_BUFLEN   (128)
#define INFO_CACHE_SIZE     (0)

typedef enum
{
    BL_INFO_STATE_UNINITIALIZED,
    BL_INFO_STATE_IDLE,
    BL_INFO_STATE_AWAITING_RECOVERY,
    BL_INFO_STATE_BACKUP,
    BL_INFO_STATE_RESET,
    BL_INFO_STATE_RECOVER
} bl_info_state_t;

typedef struct
{
    uint16_t len;
    uint16_t type;
} bootloader_info_header_t;

typedef struct
{
    bootloader_info_header_t header;
    bl_info_entry_t entry;
} info_buffer_t;

typedef enum
{
    INFO_COPY_STATE_IDLE,
    INFO_COPY_STATE_ERASE,
    INFO_COPY_STATE_METAWRITE,
    INFO_COPY_STATE_DATAWRITE,
    INFO_COPY_STATE_WAIT_FOR_IDLE,
} info_copy_state_t;

typedef struct
{
    info_copy_state_t state;
    bootloader_info_t* p_dst;
    bootloader_info_t* p_src;
    info_buffer_t* p_src_info;
    info_buffer_t* p_dst_info;
} info_copy_t;

typedef struct
{
    bl_info_type_t type;
    uint16_t offset;
} info_cache_entry_t;

static bootloader_info_t*               mp_bl_info_page;
static bootloader_info_t*               mp_bl_info_bank_page;
static uint8_t                          mp_info_entry_buffer[INFO_WRITE_BUFLEN] __attribute__((aligned(4)));
static info_buffer_t*                   mp_info_entry_head;
static info_buffer_t*                   mp_info_entry_tail;
static const bootloader_info_header_t   m_invalid_header = {0xFFFF, 0x0000}; /**< Flash buffer used for invalidating entries. */
static bl_info_state_t                  m_state;
static bool                             m_write_in_progress;
static info_copy_t                      m_info_copy;
static void*                            mp_write_pos;
#if INFO_CACHE_SIZE > 0
static info_cache_entry_t               m_info_cache[INFO_CACHE_SIZE];
static uint8_t                          m_info_cache_index;
#endif
#ifdef BL_LOG
static char*                            mp_copy_state_str[] = {"IDLE", "ERASE", "METAWRITE", "DATAWRITE", "WAIT FOR IDLE"};
#endif
/******************************************************************************
* Static functions
******************************************************************************/
static bl_info_entry_t* info_entry_get_from_cache(bl_info_type_t type)
{
#if INFO_CACHE_SIZE > 0
#ifdef BL_LOG
    static uint32_t hits = 0, misses = 0;
#endif
    for (uint32_t i = 0; i < INFO_CACHE_SIZE; ++i)
    {
        if (m_info_cache[i].type == type)
        {
            __LOG("INFO CACHE HIT! Hits/misses: %u/%u\n", ++hits, misses);
            return (bl_info_entry_t*) ((uint32_t) mp_bl_info_page + m_info_cache[i].offset);
        }
    }
    ++misses;
#endif
    return NULL;
}

static void info_entry_cache_invalidate(bl_info_type_t type)
{
#if INFO_CACHE_SIZE > 0
    for (uint32_t i = 0; i < INFO_CACHE_SIZE; ++i)
    {
        if (m_info_cache[i].type == type)
        {
            m_info_cache[i].type = BL_INFO_TYPE_INVALID;
        }
    }
#endif
}


static inline info_buffer_t* bootloader_info_iterate(info_buffer_t* p_buf)
{
    return (info_buffer_t*) (((uint32_t) p_buf) + ((uint32_t) p_buf->header.len) * 4);
}

static bl_info_entry_t* info_entry_get(bootloader_info_t* p_bl_info_page, bl_info_type_t type)
{
    if (p_bl_info_page->metadata.metadata_len == 0xFF)
    {
        return NULL;
    }

    info_buffer_t* p_buffer =
        (info_buffer_t*)
        ((uint32_t) p_bl_info_page + ((bootloader_info_t*) p_bl_info_page)->metadata.metadata_len);

    uint32_t iterations = 0;
    bl_info_type_t iter_type = (bl_info_type_t) p_buffer->header.type;
    while (iter_type != type)
    {
        p_buffer = bootloader_info_iterate(p_buffer);
        if ((uint32_t) p_buffer > ((uint32_t) p_bl_info_page) + PAGE_SIZE ||
            (
             (iter_type == BL_INFO_TYPE_LAST) &&
             (iter_type != type)
            ) ||
            ++iterations > PAGE_SIZE / 2)
        {
            return NULL; /* out of bounds */
        }
        iter_type = (bl_info_type_t) p_buffer->header.type;
    }
    return &p_buffer->entry;
}

static uint32_t entry_header_invalidate(bootloader_info_header_t* p_header)
{
    /* TODO: optimization: check if the write only adds 0-bits to the current value,
       in which case we can just overwrite the current. */
    if ((uint32_t) p_header & 0x03)
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_ADDR);
    }

    return flash_write((uint32_t*) p_header, (uint8_t*) &m_invalid_header, HEADER_LEN);
}

