NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/bootloader_info.c
static void free_write_buffer(info_buffer_t* p_buf)
{
    /* This must happen in order. */
    if (p_buf != mp_info_entry_tail)
    {
        __LOG(RTT_CTRL_TEXT_RED
                "ERROR: Freeing the wrong write buffer: 0x%x (should be 0x%x)\n",
                p_buf, mp_info_entry_tail);
        APP_ERROR_CHECK(NRF_ERROR_INVALID_ADDR);
    }

    /* The end-of-entries entry may have max length - treat as empty entry */
    if (mp_info_entry_tail->header.len == 0xFFFF)
    {
        mp_info_entry_head->header.len += 1;
    }
    else
    {
        mp_info_entry_head->header.len += p_buf->header.len;
    }
    mp_info_entry_tail = (info_buffer_t*) ((uint32_t) p_buf + p_buf->header.len * 4);
    if (mp_info_entry_tail == (info_buffer_t*) (mp_info_entry_buffer + INFO_WRITE_BUFLEN))
    {
        mp_info_entry_tail = (info_buffer_t*) mp_info_entry_buffer;
    }
    if (mp_info_entry_tail->header.type == BL_INFO_TYPE_LAST &&
        mp_info_entry_tail->header.len == 0xFFFF)
    {
        /* Also free the end-entry */
        mp_info_entry_tail  = ((info_buffer_t*) ((uint8_t*) mp_info_entry_tail + 4));

        if (mp_info_entry_tail == (info_buffer_t*) (mp_info_entry_buffer + INFO_WRITE_BUFLEN))
        {
            mp_info_entry_tail = (info_buffer_t*) mp_info_entry_buffer;
        }
    }
}

static void place_head_after_entry(info_buffer_t* p_entry)
{
    mp_info_entry_head = (info_buffer_t*) ((uint32_t) p_entry + p_entry->header.len * 4);
    if (mp_info_entry_head == (info_buffer_t*) (mp_info_entry_buffer + INFO_WRITE_BUFLEN))
    {
        mp_info_entry_head = (info_buffer_t*) mp_info_entry_buffer;
    }
    if (mp_info_entry_head != mp_info_entry_tail)
    {
        mp_info_entry_head->header.len = ((uint32_t) mp_info_entry_tail - (uint32_t) mp_info_entry_head) / 4;
        if (mp_info_entry_tail < mp_info_entry_head)
        {
            mp_info_entry_head->header.len += INFO_WRITE_BUFLEN / 4;
        }
        mp_info_entry_head->header.type = BL_INFO_TYPE_INVALID;
    }
}

static info_buffer_t* get_write_buffer(uint32_t req_space)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);

    if (mp_info_entry_head->header.len * 4 < req_space || mp_info_entry_head->header.type != BL_INFO_TYPE_INVALID)
    {
        _ENABLE_IRQS(was_masked);
        return NULL;
    }

    if (mp_info_entry_head == mp_info_entry_tail)
    {
        /* the entire buffer is empty, let's just reset */
        mp_info_entry_head = (info_buffer_t*) mp_info_entry_buffer;
        mp_info_entry_tail = (info_buffer_t*) mp_info_entry_buffer;

        info_buffer_t* p_ret = mp_info_entry_head;
        p_ret->header.len = req_space / 4;
        p_ret->header.type = BL_INFO_TYPE_INVALID;
        place_head_after_entry(p_ret);
        _ENABLE_IRQS(was_masked);
        return p_ret;
    }

    const uint32_t space_until_rollover = ((uint32_t) mp_info_entry_buffer + INFO_WRITE_BUFLEN - (uint32_t) mp_info_entry_head);

    /* check if we have to put it on the other side of the rollover. */
    if (req_space > space_until_rollover)
    {
        /* can we fit it at the other side of the rollover? */
        if (req_space <= (uint32_t) mp_info_entry_head->header.len * 4 - space_until_rollover)
        {
            /* the last entry before the rollover is now padding, let's mark it as unused */
            mp_info_entry_head->header.type = BL_INFO_TYPE_LAST;
            mp_info_entry_head->header.len = space_until_rollover / 4;

            mp_info_entry_head = (info_buffer_t*) mp_info_entry_buffer;
            info_buffer_t* p_ret = mp_info_entry_head;
            p_ret->header.len = req_space / 4;
            p_ret->header.type = BL_INFO_TYPE_INVALID;
            place_head_after_entry(p_ret);
            _ENABLE_IRQS(was_masked);
            return p_ret;
        }
        else
        {
            /* Couldn't fit the entry at either side of the rollover */
            _ENABLE_IRQS(was_masked);
            return NULL;
        }
    }
    else
    {
        /* straight forward put */
        info_buffer_t* p_ret = mp_info_entry_head;
        p_ret->header.len = req_space / 4;
        p_ret->header.type = BL_INFO_TYPE_INVALID;
        place_head_after_entry(p_ret);
        _ENABLE_IRQS(was_masked);
        return p_ret;
    }
}

static bootloader_info_header_t* bootloader_info_header_get(bl_info_entry_t* p_entry)
{
    if (p_entry == NULL || (uint32_t) p_entry == FLASH_SIZE)
    {
        return NULL;
    }
    return (bootloader_info_header_t*) ((uint32_t) p_entry - 4 * mp_bl_info_page->metadata.entry_header_length);
}

static inline info_buffer_t* bootloader_info_first_unused_get(bootloader_info_t* p_bl_info_page)
{
    bl_info_entry_t* p_entry = info_entry_get(
            p_bl_info_page,
            BL_INFO_TYPE_LAST);

    return (info_buffer_t*) (p_entry ? bootloader_info_header_get(p_entry) : NULL);
}

static void info_copy_state_set(info_copy_state_t state)
{
    m_info_copy.state = state;
    __LOG( "STATE: %s\n", mp_copy_state_str[state]);
}

/* COPY PAGE FUNCTIONS */
static void copy_page_write_meta(void)
{
    /* Write metadata header */
    __LOG( "Writing meta to dest\n");
    flash_write(&m_info_copy.p_dst->metadata,
                &m_info_copy.p_src->metadata,
                sizeof(m_info_copy.p_src->metadata));
}

static void copy_page_write_next_data(void)
{
    while ((uint32_t) m_info_copy.p_src_info < ((uint32_t) m_info_copy.p_src + PAGE_SIZE))
    {
        bl_info_type_t type = (bl_info_type_t) m_info_copy.p_src_info->header.type;

        if (type == BL_INFO_TYPE_UNUSED)
        {
            /* We've reached the end */
            break;
        }

        if (type != BL_INFO_TYPE_INVALID)
        {
            __LOG( "Write entry 0x%x to dest... ", type);
            /* copy entry */
            uint32_t len = m_info_copy.p_src_info->header.len * 4;

            if (type == BL_INFO_TYPE_LAST)
            {
                len = 4;
            }

            if ((uint8_t*) m_info_copy.p_dst_info + len > (uint8_t*) m_info_copy.p_dst + PAGE_SIZE)
            {
                /* Implementation error */
                APP_ERROR_CHECK(NRF_ERROR_INTERNAL);
            }

            if (flash_write(m_info_copy.p_dst_info, m_info_copy.p_src_info, len) != NRF_SUCCESS)
            {
                /* We've filled the flash queue. Wait for a slot to open to move on. */
                __LOG( "FAIL\n");
                return;
            }

            __LOG( "OK\n");
            /* Only iterate the dst entry if we actually wrote anything. */
            m_info_copy.p_dst_info = (info_buffer_t*) ((uint8_t*) m_info_copy.p_dst_info + len);
        }

