NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/bootloader_info.c
        m_info_copy.p_src_info = bootloader_info_iterate(m_info_copy.p_src_info);
    }

    /* we only get here when we're done writing all the data */
    info_copy_state_set(INFO_COPY_STATE_WAIT_FOR_IDLE);
}

static void copy_page_on_flash_idle(void)
{
    switch (m_info_copy.state)
    {
        case INFO_COPY_STATE_ERASE:
            /* We went idle without getting the erase operation success, try again */
            flash_erase(m_info_copy.p_dst, PAGE_SIZE);
            break;
        case INFO_COPY_STATE_METAWRITE:
            /* We went idle without getting the write operation success, try again */
            copy_page_write_meta();
            break;
        case INFO_COPY_STATE_WAIT_FOR_IDLE:
            /* all operations have finished. */
            info_copy_state_set(INFO_COPY_STATE_IDLE);
            break;
        default:
            break;
    }
}

static void copy_page_on_flash_op_end(flash_op_type_t op, void* p_context)
{
    /* execute next step in the process. */
    switch (m_info_copy.state)
    {
        case INFO_COPY_STATE_ERASE:
            if (op == FLASH_OP_TYPE_ERASE && p_context == m_info_copy.p_dst)
            {
                info_copy_state_set(INFO_COPY_STATE_METAWRITE);
                copy_page_write_meta();
            }
            break;
        case INFO_COPY_STATE_METAWRITE:
            if (op == FLASH_OP_TYPE_WRITE && p_context == &m_info_copy.p_src->metadata)
            {
                __LOG( "Writing data to dest\n");
                info_copy_state_set(INFO_COPY_STATE_DATAWRITE);
                m_info_copy.p_src_info = (info_buffer_t*) m_info_copy.p_src->data;
                m_info_copy.p_dst_info = (info_buffer_t*) m_info_copy.p_dst->data;
                copy_page_write_next_data();
            }
            else
            {
                __LOG( "METAWRITE FAIL: op=0x%x, context = 0x%x\n", op, p_context);
            }
            break;
        case INFO_COPY_STATE_DATAWRITE:
            copy_page_write_next_data();
            break;

        default:
            break;
    }
}

static uint32_t copy_page(bootloader_info_t* p_dst, bootloader_info_t* p_src)
{
    if (m_info_copy.state != INFO_COPY_STATE_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    __LOG( "COPYING 0x%x->0x%x\n", p_src, p_dst);

    m_info_copy.p_dst = p_dst;
    m_info_copy.p_src = p_src;
    info_copy_state_set(INFO_COPY_STATE_ERASE);
    if (!m_write_in_progress)
    {
        flash_erase(p_dst, PAGE_SIZE);
    }
    return NRF_SUCCESS;
}

static uint32_t backup(void)
{
    uint32_t error_code = copy_page(mp_bl_info_bank_page, mp_bl_info_page);
    if (error_code == NRF_SUCCESS)
    {
        m_state = BL_INFO_STATE_BACKUP;
    }
    return error_code;
}

/** Pull in all entries from the bank. */
static uint32_t recover(void)
{
#if INFO_CACHE_SIZE > 0
    memset(&m_info_cache, 0, sizeof(m_info_cache));
#endif
    uint32_t error_code = copy_page(mp_bl_info_page, mp_bl_info_bank_page);
    if (error_code == NRF_SUCCESS)
    {
        m_state = BL_INFO_STATE_RECOVER;
    }
    return error_code;
}

uint32_t entry_invalidate(bootloader_info_t* p_info_page, bl_info_type_t type)
{
    APP_ERROR_CHECK_BOOL(m_state == BL_INFO_STATE_IDLE);

    bootloader_info_header_t* p_header = bootloader_info_header_get(info_entry_get(p_info_page, type));
    if (p_header)
    {
        return entry_header_invalidate(p_header);
    }
    return NRF_ERROR_NOT_FOUND;
}

uint32_t entry_write(info_buffer_t* p_dst,
        bl_info_type_t type,
        bl_info_entry_t* p_entry,
        uint32_t entry_len,
        bool is_last_entry)
{
    entry_len = (entry_len + 3) & ~0x03; /* word-pad */
    info_buffer_t* p_write_buf = get_write_buffer(HEADER_LEN + entry_len + (is_last_entry * HEADER_LEN));
    if (p_write_buf == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }

    if (is_last_entry)
    {
        /* set the padding + last-header to FF */
        memset((uint8_t*) p_write_buf + entry_len, 0xFF, 8);
        ((bootloader_info_header_t*) ((uint8_t*) p_write_buf + HEADER_LEN + entry_len))->type = BL_INFO_TYPE_LAST;
    }

    p_write_buf->header.len = (entry_len + HEADER_LEN + 3) / 4;
    p_write_buf->header.type = type;
    memcpy(&p_write_buf->entry, p_entry, entry_len);

    APP_ERROR_CHECK(flash_write((uint32_t*) p_dst, (uint8_t*) p_write_buf, ((entry_len + HEADER_LEN + 3) & ~0x03) + (is_last_entry * HEADER_LEN)));

    return NRF_SUCCESS;
}

/******************************************************************************
* Interface functions
******************************************************************************/

uint32_t bootloader_info_init(uint32_t* p_bl_info_page, uint32_t* p_bl_info_bank_page)
{
    m_state = BL_INFO_STATE_UNINITIALIZED;

    if ((uint32_t) p_bl_info_page & (PAGE_SIZE - 1) ||
        (uint32_t) p_bl_info_bank_page & (PAGE_SIZE - 1))
    {
        return NRF_ERROR_INVALID_ADDR; /* must be page aligned */
    }

    mp_bl_info_page      = (bootloader_info_t*) p_bl_info_page;
    mp_bl_info_bank_page = (bootloader_info_t*) p_bl_info_bank_page;
    mp_info_entry_head = (info_buffer_t*) mp_info_entry_buffer;
    mp_info_entry_tail = (info_buffer_t*) mp_info_entry_buffer;
    mp_info_entry_head->header.len = INFO_WRITE_BUFLEN / 4;
    mp_write_pos = bootloader_info_first_unused_get(mp_bl_info_page);

    /* make sure we have an end-of-entries entry */
    if (mp_write_pos == NULL)
    {
        /* need to restore the bank */
        info_buffer_t* p_first_unused = bootloader_info_first_unused_get(mp_bl_info_bank_page);
        if (p_first_unused == NULL)
        {
            /* bank is invalid too, no way to recover */
            return NRF_ERROR_INVALID_DATA;
        }

        APP_ERROR_CHECK(flash_erase((uint32_t*) mp_bl_info_page, PAGE_SIZE));
        APP_ERROR_CHECK(flash_write((uint32_t*) mp_bl_info_page,
                            (uint8_t*) mp_bl_info_bank_page,
                            (uint32_t) p_first_unused + 4 - (uint32_t) mp_bl_info_bank_page));
    }

    m_state = BL_INFO_STATE_IDLE;
    return NRF_SUCCESS;
}

bootloader_info_t* bootloader_info_get(void)
{
    return (bootloader_info_t*) (mp_bl_info_page);
}

