NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/bootloader_info.c
bl_info_entry_t* bootloader_info_entry_get(bl_info_type_t type)
{
    bl_info_entry_t* p_cache_entry = info_entry_get_from_cache(type);
    if (p_cache_entry != NULL)
    {
        return p_cache_entry;
    }
    p_cache_entry = info_entry_get((bootloader_info_t*) BOOTLOADER_INFO_ADDRESS, type);
#if INFO_CACHE_SIZE > 0
    if (p_cache_entry != NULL)
    {
        m_info_cache[(m_info_cache_index++) & (INFO_CACHE_SIZE - 1)] = (info_cache_entry_t) { type, (uint32_t) p_cache_entry - (uint32_t) BOOTLOADER_INFO_ADDRESS };
    }
#endif
    return p_cache_entry;
}

bl_info_entry_t* bootloader_info_entry_put(bl_info_type_t type,
                                           bl_info_entry_t* p_entry,
                                           uint32_t length)
{
    APP_ERROR_CHECK_BOOL(m_state == BL_INFO_STATE_IDLE);
    APP_ERROR_CHECK_BOOL(length <= INFO_ENTRY_MAX_LEN);
    APP_ERROR_CHECK_BOOL((((uint32_t) mp_write_pos) & 0x03) == 0); /* must be word aligned */
    APP_ERROR_CHECK_BOOL((uint32_t) mp_write_pos > BOOTLOADER_INFO_ADDRESS);

    /* previous entry, to be invalidated after we've stored the current entry. */
    bootloader_info_header_t* p_old_header =
        bootloader_info_header_get(bootloader_info_entry_get(type));

    /* find first unused space */
    info_buffer_t* p_new_buf = mp_write_pos;

    /* we have to be able to fit the end-of-entries entry at the last word,
       therefore check entry length + HEADER_LEN */
    if (p_new_buf == NULL)
    {
        APP_ERROR_CHECK(NRF_ERROR_NULL);
        return NULL;
    }
    if (((uint32_t) p_new_buf + HEADER_LEN + length + HEADER_LEN) >= (uint32_t) ((uint32_t) mp_bl_info_page + PAGE_SIZE))
    {
        /* we've run out of space. This should have been handled before.. */
        APP_ERROR_CHECK(NRF_ERROR_INVALID_STATE);
        return NULL;
    }

    m_write_in_progress = true;

    /* store new entry in the available space, and pad */
    if (entry_write(p_new_buf, type, p_entry, length, true) != NRF_SUCCESS)
    {
        APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
        return NULL;
    }

    /* iterate write pos */
    mp_write_pos = (uint8_t*) mp_write_pos + ((length + HEADER_LEN + 3) & ~0x03);

    /* invalidate old entry of this type */
    if (p_old_header != NULL)
    {
        info_entry_cache_invalidate(type);
        if (entry_header_invalidate(p_old_header) != NRF_SUCCESS)
        {
            APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
            return NULL;
        }
    }

    /* We've run out of space, and need to recover. */
    if (((uint32_t) mp_write_pos + HEADER_LEN + INFO_ENTRY_MAX_LEN) >= ((uint32_t) mp_bl_info_page + PAGE_SIZE))
    {
        bootloader_info_reset();
    }
    __LOG( "PUT 0x%x @0x%x\n", type, &p_new_buf->entry);
    return &p_new_buf->entry;
}

uint32_t bootloader_info_entry_overwrite(bl_info_type_t type, bl_info_entry_t* p_entry)
{
    info_buffer_t* p_dst = (info_buffer_t*) bootloader_info_header_get(bootloader_info_entry_get(type));
    if (p_dst == NULL)
    {
        return NRF_ERROR_NOT_FOUND;
    }
    /* store new entry in the available space, and pad */
    uint32_t entry_length = p_dst->header.len * 4 - HEADER_LEN;

    return entry_write(p_dst, type, p_entry, entry_length, false);
}

uint32_t bootloader_info_entry_invalidate(bl_info_type_t type)
{
    __LOG("INVALIDATE 0x%x\n", type);
    info_entry_cache_invalidate(type);
    return entry_invalidate((bootloader_info_t*) BOOTLOADER_INFO_ADDRESS, type);
}

uint32_t bootloader_info_reset(void)
{
    APP_ERROR_CHECK_BOOL(m_state == BL_INFO_STATE_IDLE);

    __LOG( "RESET\n");
    m_state = BL_INFO_STATE_RESET;
    mp_write_pos = mp_bl_info_page->data;
    return backup();
}

bool bootloader_info_available(void)
{
    return (m_state == BL_INFO_STATE_IDLE);
}

bool bootloader_info_stable(void)
{
    return (m_state == BL_INFO_STATE_IDLE && !m_write_in_progress);
}

void bootloader_info_on_flash_op_end(flash_op_type_t type, void* p_context)
{
    if (type == FLASH_OP_TYPE_WRITE)
    {
        if (p_context >= (void*) mp_info_entry_buffer &&
            p_context < (void*) ((uint32_t) mp_info_entry_buffer + INFO_WRITE_BUFLEN))
        {
            free_write_buffer(p_context);
        }
    }
    copy_page_on_flash_op_end(type, p_context);
}

void bootloader_info_on_flash_idle(void)
{
    m_write_in_progress = false;
    if (m_info_copy.state != INFO_COPY_STATE_IDLE)
    {
        copy_page_on_flash_idle();
        if (m_info_copy.state == INFO_COPY_STATE_IDLE)
        {
            if (m_state == BL_INFO_STATE_BACKUP)
            {
                recover();
            }
            else if (m_state == BL_INFO_STATE_RECOVER)
            {
                /* done recovering */
                m_state = BL_INFO_STATE_IDLE;
            }
        }
    }
}

